**loc - accessing based on label  |  
iloc - accessing based on indices**

In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

In [2]:
d = {"Price": [19, 22, 13, 54, 65], "Sales": [600, 756, 587, 859, 990]}
frame = DataFrame(d)
frame

   Price  Sales
0     19    600
1     22    756
2     13    587
3     54    859
4     65    990

In [3]:
frame.loc[[3, 0]]["Price"]  # Accessing based on label of DF

3    54
0    19
Name: Price, dtype: int64

In [4]:
frame.iloc[[4]]["Price"]  # Accessing based on index

4    65
Name: Price, dtype: int64

In [5]:
d1 = DataFrame({"Price": [14, 32, 43], "Sales": [400, 456, 526]}, index=list("abc"))
d1

   Price  Sales
a     14    400
b     32    456
c     43    526

In [6]:
d1.loc[["a", "b"]]

   Price  Sales
a     14    400
b     32    456

In [7]:
d1.iloc[[0, 1]]

   Price  Sales
a     14    400
b     32    456

In [8]:
d1.loc[:, ["Price", "Sales"]]  # col access based on loc

   Price  Sales
a     14    400
b     32    456
c     43    526

In [9]:
d1.iloc[:, [0, 1]]  # col access based on iloc

   Price  Sales
a     14    400
b     32    456
c     43    526

**DataFrames from dict**

In [10]:
store = ["Walmart", "Safeway", "Total", "Trader_Joe"]
sales = [1000, 3400, 6727, 5618]
visitors_per_hr = [1391, 132, 87, 73]
Location = ["AL", "UT", "TX", "AR"]

In [11]:
list_lab = ["store", "sales", "visitors_per_hr", "Location"]
list_cols = [store, sales, visitors_per_hr, Location]

In [12]:
zipped = list(zip(list_lab, list_cols))
zipped

[('store', ['Walmart', 'Safeway', 'Total', 'Trader_Joe']),
 ('sales', [1000, 3400, 6727, 5618]),
 ('visitors_per_hr', [1391, 132, 87, 73]),
 ('Location', ['AL', 'UT', 'TX', 'AR'])]

In [13]:
data = dict(zipped)
data

{'store': ['Walmart', 'Safeway', 'Total', 'Trader_Joe'],
 'sales': [1000, 3400, 6727, 5618],
 'visitors_per_hr': [1391, 132, 87, 73],
 'Location': ['AL', 'UT', 'TX', 'AR']}

In [14]:
final = DataFrame(data)
final

        store  sales  visitors_per_hr Location
0     Walmart   1000             1391       AL
1     Safeway   3400              132       UT
2       Total   6727               87       TX
3  Trader_Joe   5618               73       AR